| tstats summariesonly=true allow_old_summaries=true count from datamodel=Endpoint.Processes where * by _time Processes.process_name Processes.process_path Processes.process_hash Processes.dest 
| rex field=Processes.process_hash "SHA256=(?<SHA256>.*)," 
| search NOT 
    [ inputlookup previously_seen_sha_list.csv |fields process_hash | rename process_hash AS SHA256
    | table SHA256] 
| dedup SHA256 
| rename "Processes.*" as * 
| fields - process_hash,count 
| rename SHA256 as process_hash