| tstats `summariesonly` count from datamodel=Endpoint.Processes where * by _time Processes.process_name Processes.process_hash Processes.dest 
| rex field=Processes.process_hash "SHA256=(?<SHA256>.*)," 
| search 
    NOT 
    [ inputlookup before_seen_shalist2.csv 
    | table SHA256] 
| dedup SHA256 
| `drop_dm_object_name(Processes)` 
| fields - process_hash,count 
| rename SHA256 as process_hash